n = 103
m1 = 1
s1 = 50
m2 = 3
s2 = 10
m3 = 5
s3 = 5
m4 = 10
s4 = 1
res = 0
print(f'текущая сдача равна {n}')
while n != 0:
    if n - s1 >= 0 and m1 != 0:
        res+=s1
        n -= s1
        m1 = m1 - 1
        print(f'Текущая сдача равна {res}, была сдана монета {s1}, монет такого номинала осталось: {m1}')
    elif n - s2 >= 0 and m2 != 0:
        res+=s2
        n-=s2
        m2 = m2 -1
        print(f'Текущая сдача равна {res}, была сдана монета {s2}, монет такого номинала осталось: {m2}')
    elif n - s3 >= 0 and m3 != 0:
        res+=s3
        n-=s3
        m3 = m3 - 1
        print(f'Текущая сдача равна {res}, была сдана монета {s3}, монет такого номинала осталось: {m3}')
    elif n - s4 >= 0 and m4 != 0:
        res+=s4
        n-=s4
        m4 = m4 - 1
        print(f'Текущая сдача равна {res}, была сдана монета {s4}, монет такого номинала осталось: {m4}')